---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveNode
source: html/39f46d4c-a87b-5fb2-43ad-55c8b5aad076.htm
---
# CurveNode Members

Returns the geometric curve object corresponding to the node.